In [1]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import VARCHAR, TEXT, FLOAT, INTEGER
from urllib.parse import quote_plus as urlquote

In [2]:
import json
with open('/Users/evelynmartinez/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movies"
engine = create_engine(connection)

In [4]:
if database_exists(connection):
    print('it exists')
else:
    create_database(connection)
    print('Database created')

it exists

## Loading data

In [5]:
basics = pd.read_csv('Data/title_basics_cleaned.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0013274,movie,Istoriya grazhdanskoy voyny,Istoriya grazhdanskoy voyny,0,2021.0,NaN,94,Documentary
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
3,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama
4,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama

In [6]:
ratings = pd.read_csv('Data/ratings_cleaned.csv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1992
1  tt0000002            5.8       268
2  tt0000003            6.5      1878
3  tt0000004            5.5       177
4  tt0000005            6.2      2662

In [7]:
akas = pd.read_csv('Data/akas_cleaned.csv.gz')
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

Normalize genre

In [8]:
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0013274,movie,Istoriya grazhdanskoy voyny,Istoriya grazhdanskoy voyny,0,2021.0,NaN,94,Documentary,[Documentary]
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
3,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,[Drama]
4,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
211623,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019.0,NaN,123,Drama,[Drama]
211624,tt9916622,movie,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,0,2015.0,NaN,57,Documentary,[Documentary]
211625,tt9916680,movie,De la ilusión al desconcierto: cine colombiano...,De la ilusión al desconcierto: cine colombiano...,0,2007.0,NaN,100,Documentary,[Documentary]
211626,tt9916730,movie,6 Gunn,6 Gunn,0,2017.0,NaN,116,Drama,[Drama]
211627,tt9916754,movie,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,0,2013.0,NaN,49,Documentary,[Documentary]

In [9]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0013274,movie,Istoriya grazhdanskoy voyny,Istoriya grazhdanskoy voyny,0,2021.0,NaN,94,Documentary,Documentary
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
211623,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019.0,NaN,123,Drama,Drama
211624,tt9916622,movie,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,0,2015.0,NaN,57,Documentary,Documentary
211625,tt9916680,movie,De la ilusión al desconcierto: cine colombiano...,De la ilusión al desconcierto: cine colombiano...,0,2007.0,NaN,100,Documentary,Documentary
211626,tt9916730,movie,6 Gunn,6 Gunn,0,2017.0,NaN,116,Drama,Drama
211627,tt9916754,movie,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,0,2013.0,NaN,49,Documentary,Documentary

In [10]:
genres_split = basics['genres'].str.split(",")

unique_genres = genres_split.explode().unique()
unique_genres

array(['Documentary', 'Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror',
       'Sci-Fi', 'Biography', 'Mystery', 'Adventure', 'Musical', 'Action',
       'Crime', 'Thriller', 'Music', 'Animation', 'Family', 'History',
       'War', 'Sport', 'Western', 'Adult', 'News', 'Reality-TV',
       'Talk-Show', 'Game-Show'], dtype=object)

In [11]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [12]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0013274  Documentary
1  tt0035423       Comedy
1  tt0035423      Fantasy
1  tt0035423      Romance
2  tt0062336        Drama

In [13]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Documentary': 7,
 'Drama': 8,
 'Family': 9,
 'Fantasy': 10,
 'Game-Show': 11,
 'History': 12,
 'Horror': 13,
 'Music': 14,
 'Musical': 15,
 'Mystery': 16,
 'News': 17,
 'Reality-TV': 18,
 'Romance': 19,
 'Sci-Fi': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [14]:
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Documentary': 7,
 'Drama': 8,
 'Family': 9,
 'Fantasy': 10,
 'Game-Show': 11,
 'History': 12,
 'Horror': 13,
 'Music': 14,
 'Musical': 15,
 'Mystery': 16,
 'News': 17,
 'Reality-TV': 18,
 'Romance': 19,
 'Sci-Fi': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [15]:
basics['genre_id'] = basics['genres_split'].apply(lambda genres: [genre_id_map[genre] for genre in genres])
basics = basics.drop(columns='genres_split')

In [16]:
genre_lookup = pd.DataFrame({'Genre_Name': genre_id_map.keys(),
                            'Genre_ID': genre_id_map.values()})
genre_lookup

     Genre_Name  Genre_ID
0        Action         0
1         Adult         1
2     Adventure         2
3     Animation         3
4     Biography         4
5        Comedy         5
6         Crime         6
7   Documentary         7
8         Drama         8
9        Family         9
10      Fantasy        10
11    Game-Show        11
12      History        12
13       Horror        13
14        Music        14
15      Musical        15
16      Mystery        16
17         News        17
18   Reality-TV        18
19      Romance        19
20       Sci-Fi        20
21        Sport        21
22    Talk-Show        22
23     Thriller        23
24          War        24
25      Western        25

In [17]:
unique_genres = sorted(basics['genres'].str.split(',').explode().unique())
title_genres_df = basics[['tconst', 'genres']].copy()

genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
#split & explode
title_genres_df['genre_id'] = title_genres_df['genres'].str.split(',').apply(lambda x: [genre_map[genre] for genre in x])
title_genres_df = title_genres_df.explode('genre_id').drop('genres', axis=1)

In [18]:
basics = basics.drop(columns=['originalTitle', 'isAdult', 'titleType','genre_id'])
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0013274,Istoriya grazhdanskoy voyny,2021.0,NaN,94,Documentary
1,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,Drama
3,tt0068865,Lives of Performers,2016.0,NaN,90,Drama
4,tt0069049,The Other Side of the Wind,2018.0,NaN,122,Drama
...,...,...,...,...,...,...
211623,tt9916538,Kuambil Lagi Hatiku,2019.0,NaN,123,Drama
211624,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,2015.0,NaN,57,Documentary
211625,tt9916680,De la ilusión al desconcierto: cine colombiano...,2007.0,NaN,100,Documentary
211626,tt9916730,6 Gunn,2017.0,NaN,116,Drama
211627,tt9916754,Chico Albuquerque - Revelações,2013.0,NaN,49,Documentary

In [19]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [20]:
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

211628

In [21]:
ratings.to_sql('title_ratings', engine, dtype=df_schema, if_exists='replace', index=False)

1350877

In [45]:
genre_lookup.to_sql('genres', engine, dtype=df_schema, if_exists='replace', index=False)

26

In [22]:
title_genres_df.to_sql('title_genres', engine, dtype=df_schema, if_exists='replace', index=False)

347270

In [26]:
tmdb_2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
tmdb_2000.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.50,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.45,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.00,1.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,7.00,3.0,NaN

In [27]:
tmdb_2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')
tmdb_2001.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.327,1233.0,PG-13
2,tt0114447,0.0,NaN,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",NaN,151007.0,en,The Silent Force,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.000,3.0,NaN
3,tt0114722,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 53, 'name...",NaN,276251.0,es,3 Noches,...,0.0,105.0,"[{'english_name': 'Spanish', 'iso_639_1': 'es'...",Released,NaN,3 Nights,0.0,0.000,0.0,NaN
4,tt0116916,0.0,/rFpHBidSlhjflmnLu7BZilyKeQR.jpg,NaN,0.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,73549.0,en,The Dark Mist,...,0.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,The Dark Mist,0.0,3.500,2.0,PG

In [28]:
tmdb_final = pd.concat([tmdb_2000, tmdb_2001], ignore_index=True)
tmdb_final

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.50,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.45,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.00,1.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,7.00,3.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5397,tt9212730,0.0,NaN,NaN,0.0,"[{'id': 27, 'name': 'Horror'}, {'id': 53, 'nam...",NaN,382630.0,ja,実録外伝 ゾンビ極道,...,0.0,88.0,"[{'english_name': 'Japanese', 'iso_639_1': 'ja...",Released,NaN,Yakuza Zombie,0.0,0.00,0.0,NaN
5398,tt9668554,0.0,NaN,NaN,0.0,"[{'id': 99, 'name': 'Documentary'}]",NaN,274300.0,en,Armageddon: Bible Prophecies and the Predictio...,...,0.0,0.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Armageddon: Bible Prophecies and the Predictio...,0.0,0.00,0.0,NaN
5399,tt9789230,0.0,NaN,NaN,0.0,[],NaN,986785.0,en,Girls Who Like Girls,...,0.0,89.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Girls Who Like Girls,0.0,0.00,0.0,NaN
5400,tt9798698,0.0,NaN,NaN,0.0,[],NaN,580269.0,en,Gay holocaust,...,0.0,0.0,[],Released,NaN,Gay holocaust,0.0,0.00,0.0,NaN
5401,tt9875278,0.0,NaN,NaN,0.0,[],NaN,657037.0,en,Meeting My Daughter,...,0.0,0.0,[],Released,NaN,Meeting My Daughter,0.0,0.00,0.0,NaN

In [29]:
tmdb_final = tmdb_final[['id', 'revenue', 'budget', 'certification', 'title']].copy()
tmdb_final

,id,revenue,budget,certification,title
0,NaN,NaN,NaN,NaN,NaN
1,62127.0,0.0,10000000.0,NaN,The Fantasticks
2,110977.0,0.0,0.0,NaN,For the Cause
3,442869.0,0.0,0.0,NaN,Gang
4,579396.0,0.0,0.0,NaN,Karobaar
...,...,...,...,...,...
5397,382630.0,0.0,0.0,NaN,Yakuza Zombie
5398,274300.0,0.0,0.0,NaN,Armageddon: Bible Prophecies and the Predictio...
5399,986785.0,0.0,0.0,NaN,Girls Who Like Girls
5400,580269.0,0.0,0.0,NaN,Gay holocaust
5401,657037.0,0.0,0.0,NaN,Meeting My Daughter

In [31]:
tmdb_data_schema = {
    'id': Integer(),
    'revenue': Integer(),
    'budget': Integer(),
    'certiication': String(length=255),
    'title': Text()}

In [41]:
tmdb_final.to_sql('tmdb_data', engine, dtype=tmdb_data_schema, if_exists='replace', index=False)

5402

In [36]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [37]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

  Tables_in_movies
0       data_final
1     title_basics
2     title_genres
3    title_ratings

title_basics

In [38]:
q = '''SELECT * FROM title_basics
        limit 5'''

pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0013274,Istoriya grazhdanskoy voyny,2021.0,None,94,Documentary
1,tt0035423,Kate & Leopold,2001.0,None,118,"Comedy,Fantasy,Romance"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70,Drama
3,tt0068865,Lives of Performers,2016.0,None,90,Drama
4,tt0069049,The Other Side of the Wind,2018.0,None,122,Drama

title_ratings

In [39]:
q = '''SELECT * FROM title_ratings
        limit 5'''

pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1992
1  tt0000002            5.8       268
2  tt0000003            6.5      1878
3  tt0000004            5.5       177
4  tt0000005            6.2      2662

title_genres

In [42]:
q = '''SELECT * FROM tmdb_data
        limit 5'''

pd.read_sql(q,engine)

         id  revenue      budget certification            title
0       NaN      NaN         NaN          None             None
1   62127.0      0.0  10000000.0          None  The Fantasticks
2  110977.0      0.0         0.0          None    For the Cause
3  442869.0      0.0         0.0          None             Gang
4  579396.0      0.0         0.0          None         Karobaar

genres

In [46]:
q = '''SELECT * FROM genres
        limit 5'''

pd.read_sql(q,engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [ ]:
title_genres

In [44]:
q = '''SELECT * FROM title_genres
        limit 5'''

pd.read_sql(q,engine)

      tconst  genre_id
0  tt0013274         7
1  tt0035423         5
2  tt0035423        10
3  tt0035423        19
4  tt0062336         8